earlephilhower/arduino-pico/boards.txt
genericpicoprobe.menu.flash.4194304_2097152.build.eeprom_start=272625664
genericpicoprobe.menu.flash.4194304_2097152.build.fs_start=270528512
genericpicoprobe.menu.flash.4194304_2097152.build.fs_end=272625664
genericpicoprobe.menu.flash.8388608_0=8MB (no FS)
genericpicoprobe.menu.flash.8388608_0.upload.maximum_size=8384512
genericpicoprobe.menu.flash.8388608_0.build.flash_length=8384512
genericpicoprobe.menu.flash.8388608_0.build.eeprom_start=276819968
genericpicoprobe.menu.flash.8388608_0.build.fs_start=276819968
genericpicoprobe.menu.flash.8388608_0.build.fs_end=276819968
genericpicoprobe.menu.flash.8388608_4194304=8MB (FS: 4MB)
genericpicoprobe.menu.flash.8388608_4194304.upload.maximum_size=4190208
genericpicoprobe.menu.flash.8388608_4194304.build.flash_length=4190208
genericpicoprobe.menu.flash.8388608_4194304.build.eeprom_start=276819968
genericpicoprobe.menu.flash.8388608_4194304.build.fs_start=272625664
genericpicoprobe.menu.flash.8388608_4194304.build.fs_end=276819968
genericpicoprobe.menu.flash.16777216_0=16MB (no FS)
genericpicoprobe.menu.flash.16777216_0.upload.maximum_size=16773120
genericpicoprobe.menu.flash.16777216_0.build.flash_length=16773120
genericpicoprobe.menu.flash.16777216_0.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_0.build.fs_start=285208576
genericpicoprobe.menu.flash.16777216_0.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_8388608=16MB (FS: 8MB)
genericpicoprobe.menu.flash.16777216_8388608.upload.maximum_size=8384512
genericpicoprobe.menu.flash.16777216_8388608.build.flash_length=8384512
genericpicoprobe.menu.flash.16777216_8388608.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_8388608.build.fs_start=276819968
genericpicoprobe.menu.flash.16777216_8388608.build.fs_end=285208576
genericpicoprobe.menu.freq.125=125 MHz
genericpicoprobe.menu.freq.125.build.f_cpu=125000000L
genericpicoprobe.menu.freq.50=50 MHz
genericpicoprobe.menu.freq.50.build.f_cpu=50000000L
genericpicoprobe.menu.freq.100=100 MHz
genericpicoprobe.menu.freq.100.build.f_cpu=100000000L
genericpicoprobe.menu.freq.133=133 MHz
genericpicoprobe.menu.freq.133.build.f_cpu=133000000L
genericpicoprobe.menu.freq.150=150 MHz (Overclock)
genericpicoprobe.menu.freq.150.build.f_cpu=150000000L
genericpicoprobe.menu.freq.175=175 MHz (Overclock)
genericpicoprobe.menu.freq.175.build.f_cpu=175000000L
genericpicoprobe.menu.freq.200=200 MHz (Overclock)
genericpicoprobe.menu.freq.200.build.f_cpu=200000000L
genericpicoprobe.menu.freq.225=225 MHz (Overclock)
genericpicoprobe.menu.freq.225.build.f_cpu=225000000L
genericpicoprobe.menu.freq.250=250 MHz (Overclock)
genericpicoprobe.menu.freq.250.build.f_cpu=250000000L
genericpicoprobe.menu.freq.275=275 MHz (Overclock)
genericpicoprobe.menu.freq.275.build.f_cpu=275000000L
genericpicoprobe.menu.freq.300=300 MHz (Overclock)
genericpicoprobe.menu.freq.300.build.f_cpu=300000000L
genericpicoprobe.menu.dbgport.Disabled=Disabled
genericpicoprobe.menu.dbgport.Disabled.build.debug_port=
genericpicoprobe.menu.dbgport.Serial=Serial
genericpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
genericpicoprobe.menu.dbgport.Serial1=Serial1
genericpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
genericpicoprobe.menu.dbgport.Serial2=Serial2
genericpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
genericpicoprobe.menu.dbglvl.None=None
genericpicoprobe.menu.dbglvl.None.build.debug_level=
genericpicoprobe.menu.dbglvl.Core=Core
genericpicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
genericpicoprobe.menu.dbglvl.SPI=SPI
genericpicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
genericpicoprobe.menu.dbglvl.Wire=Wire
genericpicoprobe.menu.dbglvl.Wire.build.debug_level=DDEBUG_RP2040_WIRE
genericpicoprobe.menu.dbglvl.All=All
genericpicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
genericpicoprobe.menu.dbglvl.NDEBUG=NDEBUG
genericpicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
genericpicoprobe.menu.boot2.boot2_generic_03h_2_padded_checksum=Generic SPI /2
genericpicoprobe.menu.boot2.boot2_generic_03h_2_padded_checksum.build.boot2=boot2_generic_03h_2_padded_checksum
genericpicoprobe.menu.boot2.boot2_generic_03h_4_padded_checksum=Generic SPI /4
genericpicoprobe.menu.boot2.boot2_generic_03h_4_padded_checksum.build.boot2=boot2_generic_03h_4_padded_checksum
genericpicoprobe.menu.boot2.boot2_is25lp080_2_padded_checksum=IS25LP080 QSPI /2
genericpicoprobe.menu.boot2.boot2_is25lp080_2_padded_checksum.build.boot2=boot2_is25lp080_2_padded_checksum
genericpicoprobe.menu.boot2.boot2_is25lp080_4_padded_checksum=IS25LP080 QSPI /4
genericpicoprobe.menu.boot2.boot2_is25lp080_4_padded_checksum.build.boot2=boot2_is25lp080_4_padded_checksum
genericpicoprobe.menu.boot2.boot2_w25q080_2_padded_checksum=W25Q080 QSPI /2
genericpicoprobe.menu.boot2.boot2_w25q080_2_padded_checksum.build.boot2=boot2_w25q080_2_padded_checksum
genericpicoprobe.menu.boot2.boot2_w25q080_4_padded_checksum=W25Q080 QSPI /4
genericpicoprobe.menu.boot2.boot2_w25q080_4_padded_checksum.build.boot2=boot2_w25q080_4_padded_checksum
genericpicoprobe.menu.boot2.boot2_w25x10cl_2_padded_checksum=W25X10CL QSPI /2
genericpicoprobe.menu.boot2.boot2_w25x10cl_2_padded_checksum.build.boot2=boot2_w25x10cl_2_padded_checksum
genericpicoprobe.menu.boot2.boot2_w25x10cl_4_padded_checksum=W25X10CL QSPI /4
genericpicoprobe.menu.boot2.boot2_w25x10cl_4_padded_checksum.build.boot2=boot2_w25x10cl_4_padded_checksum
